Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>CalculationRegister.ДополнительныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.ОсновныеНачисления</xr:Item>
				<xr:Item>InformationRegister.ОкладСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачислениеДоп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CalculationRegisters/ОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<CalculationRegister>
		<Properties>
			<Name>ОсновныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.ЗначениеЧасы</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

CalculationRegisters/ДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

InformationRegisters/ОкладСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ОкладСотрудников</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачислениеЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисление Из Начисление Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисление.ВидНачисления;
		Движение.ПериодДействияНачало = ТекСтрокаНачисление.ДатаНачало;
		Движение.ПериодДействияКонец = ТекСтрокаНачисление.ДатаОкончание;
		Движение.ПериодРегистрации = ТекСтрокаНачисление.ДатаНачало;
		Движение.Сотрудник = ТекСтрокаНачисление.Сотрудник;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать();
	
	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачислениеДоп Из НачислениеДоп Цикл
		ДвижениеДоп = Движения.ДополнительныеНачисления.Добавить();
		ДвижениеДоп.Сторно = Ложь;
		ДвижениеДоп.ВидРасчета = ТекСтрокаНачислениеДоп.ВидНачисления;
		ДвижениеДоп.ПериодРегистрации = Дата;
		Если ДвижениеДоп.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Премия Тогда 
			ДвижениеДоп.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Дата,-1));
			ДвижениеДоп.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Дата,-1));
		Иначе
			ДвижениеДоп.БазовыйПериодНачало = НачалоМесяца(Дата);
			ДвижениеДоп.БазовыйПериодКонец = КонецМесяца(Дата);
		КонецЕсли;
		ДвижениеДоп.Сотрудник = ТекСтрокаНачислениеДоп.Сотрудник;
		ДвижениеДоп.Размер = ТекСтрокаНачислениеДоп.Размер;
		Если ДвижениеДоп.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Подарок Тогда
			ДвижениеДоп.Размер = ТекСтрокаНачислениеДоп.Размер;
			ДвижениеДоп.Результат = ТекСтрокаНачислениеДоп.Размер;
		КонецЕсли;
		
	КонецЦикла;                                  
	Движения.ДополнительныеНачисления.Записать();
	
	
	//Расчет оклада	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеЧасыФактическийПериодДействия, 0) КАК ФактЧасы,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеЧасыПериодДействия, 0) КАК ПланЧасы,
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОкладСотрудниковСрезПоследних.Оклад КАК Оклад
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &Оклад) КАК ОсновныеНачисленияДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОкладСотрудников.СрезПоследних КАК ОкладСотрудниковСрезПоследних
	|		ПО ОсновныеНачисленияДанныеГрафика.Сотрудник = ОкладСотрудниковСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Для Каждого СтрДвижение Из Движения.ОсновныеНачисления Цикл 
		Если СтрДвижение.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда 
			Продолжить;
		КонецЕсли;
		ВыборкаДетальныеЗаписи.Сбросить();
		ВыборкаДетальныеЗаписи.НайтиСледующий(СтрДвижение.НомерСтроки,"НомерСтроки");
		
		СтрДвижение.Размер = ВыборкаДетальныеЗаписи.Оклад;
		
		Если СтрДвижение.Размер <= 0 Тогда 
			Отказ =  Истина;
			Сообщение = Новый СообщениеПользователю ();
			Сообщение.Текст = "Этому не установлен оклад"; 
			Сообщение.Поле = "Сотрудник";
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.КлючДанных = ЭтотОбъект.Ссылка;
			Сообщение.Сообщить();
		КонецЕсли;	
		СтрДвижение.Результат = ВыборкаДетальныеЗаписи.ФактЧасы / ВыборкаДетальныеЗаписи.ПланЧасы * СтрДвижение.Размер;
		СтрДвижение.Факт = ВыборкаДетальныеЗаписи.ФактЧасы;
	КонецЦикла;
	    Движения.ОсновныеНачисления.Записать(,Истина);
	
	// Премия по базе доп начислений+процент указан в документе 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
	|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(
	|			&МассивИзмерений,
	|			&МассивИзмерений,
	|			,
	|			ВидРасчета = &Премия
	|				И Регистратор = &Ссылка) КАК ДополнительныеНачисленияБазаОсновныеНачисления";
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Премия",ПланыВидовРасчета.ДополнительныеНачисления.Премия);
	Запрос.УстановитьПараметр("МассивИзмерений", МассивИзмерений);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для Каждого СтрДвижение Из Движения.ДополнительныеНачисления Цикл 
		Если СтрДвижение.ВидРасчета <> ПланыВидовРасчета.ДополнительныеНачисления.Премия Тогда 
			Продолжить;
		КонецЕсли;
		ВыборкаДетальныеЗаписи.Сбросить();
		ВыборкаДетальныеЗаписи.НайтиСледующий(СтрДвижение.НомерСтроки,"НомерСтроки");
		
		
		СтрДвижение.Результат = СтрДвижение.Размер / 100 * ВыборкаДетальныеЗаписи.РезультатБаза ;
	КонецЦикла;
	Движения.ДополнительныеНачисления.Записать(,Истина);
	
	// ндфл
	  Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
	|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(
	|			&МассивИзмерений,
	|			&МассивИзмерений,
	|			,
	|			ВидРасчета = &Премия
	|				И Регистратор = &Ссылка) КАК ДополнительныеНачисленияБазаОсновныеНачисления";
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Премия",ПланыВидовРасчета.ДополнительныеНачисления.НДФЛ);
	Запрос.УстановитьПараметр("МассивИзмерений", МассивИзмерений);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для Каждого СтрДвижение Из Движения.ДополнительныеНачисления Цикл 
		Если СтрДвижение.ВидРасчета <> ПланыВидовРасчета.ДополнительныеНачисления.НДФЛ Тогда 
			Продолжить;
		КонецЕсли;
		ВыборкаДетальныеЗаписи.Сбросить();
		ВыборкаДетальныеЗаписи.НайтиСледующий(СтрДвижение.НомерСтроки,"НомерСтроки");
		
		
		СтрДвижение.Результат = 13 / 100 * ВыборкаДетальныеЗаписи.РезультатБаза ;
	КонецЦикла;
	Движения.ДополнительныеНачисления.Записать(,Истина)

	
	
	
	
КонецПроцедуры
